In [1]:
%load_ext sql

In [2]:
%sql sqlite:///cssys.db

'Connected: @cssys.db'

In [3]:
%%sql

CREATE TABLE students (
    id integer, 
    firstname char(15), 
    lastname char(15), 
    age integer, 
    gender char(1), 
    gpa double, 
    primary key(id)
)

 * sqlite:///cssys.db
Done.

[]

In [4]:
%%sql

CREATE TABLE courses (
    id integer, 
    name varchar(30), 
    credit integer, 
    prereq integer, 
    primary key(id, prereq)
)

 * sqlite:///cssys.db
Done.

[]

In [5]:
%%sql

CREATE TABLE transcript (
    studentid integer, 
    courseid integer, 
    mark double, 
    semester integer, 
    credit integer, 
    primary key(studentid, courseid)
)

 * sqlite:///cssys.db
Done.

[]

In [6]:
%%sql

DROP TABLE students;
CREATE TABLE students (
    id integer, 
    firstname char(15), 
    lastname char(15), 
    dob date default '0000-00-00', 
    gender char(1), 
    gpa double, 
    primary key(id)
)

 * sqlite:///cssys.db
Done.
Done.

[]

In [7]:
%%sql

INSERT INTO students(id, firstname, lastname, dob, gender, gpa)
VALUES(1001, 'adam', 'smith', 2000-01-03, 'm', 3.1);
INSERT INTO students(id, firstname, lastname, dob, gender, gpa)
VALUES(1002, 'alice', 'frank', 1999-03-11, 'f', 3.4);
INSERT INTO students(id, firstname, lastname, dob, gender, gpa)
VALUES(1003, 'bob', 'hal', 1999-09-01, 'm', 2);

 * sqlite:///cssys.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql

INSERT INTO courses VALUES(100, 'programming', 3, NULL);
INSERT INTO courses VALUES(110, 'math', 3, NULL);
INSERT INTO courses VALUES(120, 'web', 4, NULL);
INSERT INTO courses VALUES(301, 'networking', 4, 200);
INSERT INTO courses VALUES(301, 'networking', 4, 150);
INSERT INTO courses VAlues(301, 'networking', 4, 210);
INSERT INTO courses VAlues(354, 'database', 3, 120);
INSERT INTO courses VAlues(354, 'database', 3, 110);
INSERT INTO courses VAlues(360, 'os', 3, 150);
INSERT INTO courses VAlues(360, 'os', 3, 210);

 * sqlite:///cssys.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql

INSERT INTO transcript VALUES(1001, 100, 3, 201801, 3);
INSERT INTO transcript VALUES(1001, 110, 3.5, 201801, 3);
INSERT INTO transcript VALUES(1001, 120, 2.7, 201801, 4);
INSERT INTO transcript VALUES(1001, 301, 3.4, 201802, 4);
INSERT INTO transcript VALUES(1002, 100, 3, 201801, 3);
INSERT INTO transcript VALUES(1002, 110, 3.2, 201901, 3);
INSERT INTO transcript VALUES(1002, 301, 3.1, 201902, 4);
INSERT INTO transcript VALUES(1003, 100, 2.5, 201801, 3);
INSERT INTO transcript VALUES(1003, 120, 3.5, 201901, 4);
INSERT INTO transcript VALUES(1003, 301, 2.8, 201902, 4);
INSERT INTO transcript VALUES(1003, 354, 4, 201903, 3);
INSERT INTO transcript VALUES(1003, 360, 3.5, 201802, 3);

 * sqlite:///cssys.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql

SELECT * FROM students

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', 1996, 'm', 3.1),
 (1002, 'alice', 'frank', 1985, 'f', 3.4),
 (1003, 'bob', 'hal', 1989, 'm', 2.0)]

In [11]:
%%sql

SELECT * FROM courses
WHERE credit = 3

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

In [12]:
%%sql

SELECT * FROM transcript
WHERE mark > 3
AND credit >=3

 * sqlite:///cssys.db
Done.

[(1001, 110, 3.5, 201801, 3),
 (1001, 301, 3.4, 201802, 4),
 (1002, 110, 3.2, 201901, 3),
 (1002, 301, 3.1, 201902, 4),
 (1003, 120, 3.5, 201901, 4),
 (1003, 354, 4.0, 201903, 3),
 (1003, 360, 3.5, 201802, 3)]

In [13]:
%%sql

SELECT studentid, courseid, mark FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0),
 (1001, 110, 3.5),
 (1001, 120, 2.7),
 (1001, 301, 3.4),
 (1002, 100, 3.0),
 (1002, 110, 3.2),
 (1002, 301, 3.1),
 (1003, 100, 2.5),
 (1003, 120, 3.5),
 (1003, 301, 2.8),
 (1003, 354, 4.0),
 (1003, 360, 3.5)]

In [14]:
%%sql

SELECT studentid, courseid, mark FROM transcript
WHERE semester = 201902

 * sqlite:///cssys.db
Done.

[(1002, 301, 3.1), (1003, 301, 2.8)]

In [15]:
%%sql

SELECT DISTINCT courseid FROM transcript

 * sqlite:///cssys.db
Done.

[(100,), (110,), (120,), (301,), (354,), (360,)]

In [16]:
%%sql

SELECT firstname, lastname, gpa FROM students
ORDER BY gpa DESC

 * sqlite:///cssys.db
Done.

[('alice', 'frank', 3.4), ('adam', 'smith', 3.1), ('bob', 'hal', 2.0)]

In [17]:
%%sql

ALTER TABLE transcript ADD lettergrade char(1);
UPDATE transcript SET lettergrade = 'A' WHERE mark >=3.5;
UPDATE transcript SET lettergrade = 'B' WHERE mark >=3 AND mark < 3.5;
UPDATE transcript SET lettergrade = 'C' WHERE mark >=2.5 AND mark < 3;
UPDATE transcript SET lettergrade = 'D' WHERE mark >=2 AND mark < 2.5;
UPDATE transcript SET lettergrade = 'F' WHERE mark <2;
SELECT studentid, courseid, lettergrade FROM transcript

 * sqlite:///cssys.db
Done.
4 rows affected.
5 rows affected.
3 rows affected.
0 rows affected.
0 rows affected.
Done.

[(1001, 100, 'B'),
 (1001, 110, 'A'),
 (1001, 120, 'C'),
 (1001, 301, 'B'),
 (1002, 100, 'B'),
 (1002, 110, 'B'),
 (1002, 301, 'B'),
 (1003, 100, 'C'),
 (1003, 120, 'A'),
 (1003, 301, 'C'),
 (1003, 354, 'A'),
 (1003, 360, 'A')]